org/blog/2021/sicp-1.org
#+SETUPFILE: ~/repo/blog/tpl/nil-site-tpl.org
#+TITLE: SICP1: 用过程构建抽象

[[https://mitpress.mit.edu/sites/default/files/sicp/full-text/book/book-Z-H-9.html#%_chap_1]]

#+BEGIN_QUOTE
The acts of the mind, wherein it exerts its power over simple ideas, are
chiefly these three:

1. Combining several simple ideas into one compound one, and thus all
   complex ideas are made.
2. The second is bring two ideas, whether simple or complex, together,
   and setting them by one another so as to take a view of them at once,
   without uniting them into one, by which it gets all its ideas of
   relations.
3. The third is separating them from all other ideas that accompany them
   in their real existence: this is called abstraction, and thus all its
   general ideas are made.

------John Locke, /An Essay Concerning Human Understanding/ (1690)
#+END_QUOTE

* Programming in Lisp

Lisp was invented in the late 1950s as a formalism for reasoning about
the use of certain kinds of logical expressions.

Lisp, whose name is an acronym for LISt Processing. Lisp is the second
oldest language in widespread use today.

* 记单词

| 英文          | 英语解释                                                                                                                                                                                                                                                                                                                                                              | 翻译                       |
|---------------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------------------------|
| abstraction   | the situation in which a subject is very general and not based on real situations                                                                                                                                                                                                                                                                                     | 抽象                       |
| procedure     | A procedure is a tried and true process or method used to accomplish a particular task.                                                                                                                                                                                                                                                                               | 规程                       |
| compound      | If you compound a problem you add something to it to make it worse, like say, putting water on a grease fire. Compound means to combine; a compound is a combination or mixture of two or more things.                                                                                                                                                                | 复合的；混合               |
| being         | A being is any living creature, from a person to a bug. Being also refers to the state of existing.                                                                                                                                                                                                                                                                   | 存在                       |
| inhabit       | When you inhabit a place, you live there. When actors inhabit their roles, they seem to become the characters, no longer actors reciting their lines. It is like they live the life of the character.                                                                                                                                                                 | 占据                       |
| evolve        | When something evolves, it changes, or develops over time, like your taste in music and clothes, which evolve as you get older.                                                                                                                                                                                                                                       | 发展；进化                 |
| manipulate    | To manipulate something means to handle it skillfully, like the way a sculptor manipulates clay or a really good politician works a crowd.                                                                                                                                                                                                                            | 操作；巧妙地处理           |
| sorcerer      | Magical, mysterious, and quite possibly mythical, a sorcerer is a name for a spell-casting wizard.                                                                                                                                                                                                                                                                    | 魔术师                     |
| compose       | To compose is to put something together, like a song, poem, or even yourself. You might want to compose yourself before returning to the party after a good cry.                                                                                                                                                                                                      | 构成；作曲；使平静         |
| dsiburse      | If someone wants to disburse funds to you, stick around --- it means they're going to give you money!                                                                                                                                                                                                                                                                 | 支付                       |
| conjure       | If your mom can magically conjure up the most delicious meals from the most random ingredients in the kitchen, she might just be the best cook in the neighborhood.                                                                                                                                                                                                   | 变魔术                     |
| symbolic      | When one thing represents something else that's more abstract, it is symbolic, like a cowboy's black hat in western films is symbolic of his sinister intentions.                                                                                                                                                                                                     | 象征的                     |
| arcane        | Something arcane is understood or known by only a few people. Almost everyone knows the basics of baseball, but only an elite few possess the arcane knowledge of its history that marks the true fan.                                                                                                                                                                | 神秘的；晦涩难解的         |
| esoteric      | Pssst... do you know the secret handshake? If you haven't been brought into the inner circle of those with special knowledge, esoteric things will remain a mystery to you.                                                                                                                                                                                           | 只有内行才懂的             |
| prescribe     | To prescribe is make orders or give directions for something to be done. These days, the word is mainly used by doctors who prescribe medications to take.                                                                                                                                                                                                            | 规定；开处方               |
| unanticipated | Unanticipated means "unexpected." Finding a candy bar in your lunchbox when your mom usually packs nothing but health food would be an unanticipated delight.                                                                                                                                                                                                         | 意料之外的                 |
| expertise     | When you're an expert at something, you show expertise --- or an exceptional knowledge of the subject. "He had expertise in accounting, having excelled in math, but he had even more expertise in dancing, his hobby since a small child."                                                                                                                           | 专业知识                   |
| collapse      | To collapse means to fall over, cave in, or totally crumple. After finding out that the stock market has collapsed and your investments along with it, you'd probably collapse to the ground and sob uncontrollably.                                                                                                                                                  | （突然）倒塌；（货币）暴跌 |
| quantitative  | If your boss asks you to do a quantitative analysis of this month's ice cream sales, he's not asking you to talk about how pleasant the customer interactions were. He wants numbers: how many cones did you sell of each flavor?                                                                                                                                     | 数量的                     |
| formalism     | there is no transcendent meaning to a discipline other than the literal content created by a practitioner                                                                                                                                                                                                                                                             | 形式主义                   |
| conceive      | To conceive is to come up with an idea. If you conceive a plan for your little brother's birthday, you dream up the perfect party, complete with a magician, rented ponies, and a cake shaped like a rocket.                                                                                                                                                          | 怀孕；构思                 |
| acronym       | An acronym is a word or name formed from the initial components of a longer name or phrase, usually using individual initial letters, as in NATO (North Atlantic Treaty Organization) or EU (European Union), but sometimes using syllables, as in Benelux (Belgium, Netherlands and Luxembourg), or a mixture of the two, as in radar (RAdio Detection And Ranging). | 首字母缩略词               |
| algebraic     |                                                                                                                                                                                                                                                                                                                                                                       | 代数的                     |
| linguistic    | Use the adjective linguistic to describe anything related to language, like the linguistic difficulties you might have if you visit a place where you do not speak the same language as everyone else.                                                                                                                                                                | 语言的                     |

* 学习进度

- 2021-07-03 08:00~11:30 读完
  [[https://mitpress.mit.edu/sites/default/files/sicp/full-text/book/book-Z-H-9.html#%_chap_1][1 Building Abstractions with Procedures]]
- 2021-07-04 13:00~14:00 查阅
  [[https://mitpress.mit.edu/sites/default/files/sicp/full-text/book/book-Z-H-9.html#%_chap_1][1 Building Abstractions with Procedures]] 中不知道意思的生词