blog/2021/sicp-1.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-09 Wed 15:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>SICP1: 用过程构建抽象</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">SICP1: 用过程构建抽象</h1>
</header><p>
<a href="https://mitpress.mit.edu/sites/default/files/sicp/full-text/book/book-Z-H-9.html#%_chap_1">https://mitpress.mit.edu/sites/default/files/sicp/full-text/book/book-Z-H-9.html#%_chap_1</a>
</p>

<blockquote>
<p>
The acts of the mind, wherein it exerts its power over simple ideas, are
chiefly these three:
</p>

<ol class="org-ol">
<li>Combining several simple ideas into one compound one, and thus all
complex ideas are made.</li>
<li>The second is bring two ideas, whether simple or complex, together,
and setting them by one another so as to take a view of them at once,
without uniting them into one, by which it gets all its ideas of
relations.</li>
<li>The third is separating them from all other ideas that accompany them
in their real existence: this is called abstraction, and thus all its
general ideas are made.</li>
</ol>

<p>
-&#x2013;&#x2014;John Locke, <i>An Essay Concerning Human Understanding</i> (1690)
</p>
</blockquote>

<div id="outline-container-org8d3b5f3" class="outline-2">
<h2 id="org8d3b5f3">Programming in Lisp</h2>
<div class="outline-text-2" id="text-org8d3b5f3">
<p>
Lisp was invented in the late 1950s as a formalism for reasoning about
the use of certain kinds of logical expressions.
</p>

<p>
Lisp, whose name is an acronym for LISt Processing. Lisp is the second
oldest language in widespread use today.
</p>
</div>
</div>

<div id="outline-container-orgf92be55" class="outline-2">
<h2 id="orgf92be55">记单词</h2>
<div class="outline-text-2" id="text-orgf92be55">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">英文</th>
<th scope="col" class="org-left">英语解释</th>
<th scope="col" class="org-left">翻译</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">abstraction</td>
<td class="org-left">the situation in which a subject is very general and not based on real situations</td>
<td class="org-left">抽象</td>
</tr>

<tr>
<td class="org-left">procedure</td>
<td class="org-left">A procedure is a tried and true process or method used to accomplish a particular task.</td>
<td class="org-left">规程</td>
</tr>

<tr>
<td class="org-left">compound</td>
<td class="org-left">If you compound a problem you add something to it to make it worse, like say, putting water on a grease fire. Compound means to combine; a compound is a combination or mixture of two or more things.</td>
<td class="org-left">复合的；混合</td>
</tr>

<tr>
<td class="org-left">being</td>
<td class="org-left">A being is any living creature, from a person to a bug. Being also refers to the state of existing.</td>
<td class="org-left">存在</td>
</tr>

<tr>
<td class="org-left">inhabit</td>
<td class="org-left">When you inhabit a place, you live there. When actors inhabit their roles, they seem to become the characters, no longer actors reciting their lines. It is like they live the life of the character.</td>
<td class="org-left">占据</td>
</tr>

<tr>
<td class="org-left">evolve</td>
<td class="org-left">When something evolves, it changes, or develops over time, like your taste in music and clothes, which evolve as you get older.</td>
<td class="org-left">发展；进化</td>
</tr>

<tr>
<td class="org-left">manipulate</td>
<td class="org-left">To manipulate something means to handle it skillfully, like the way a sculptor manipulates clay or a really good politician works a crowd.</td>
<td class="org-left">操作；巧妙地处理</td>
</tr>

<tr>
<td class="org-left">sorcerer</td>
<td class="org-left">Magical, mysterious, and quite possibly mythical, a sorcerer is a name for a spell-casting wizard.</td>
<td class="org-left">魔术师</td>
</tr>

<tr>
<td class="org-left">compose</td>
<td class="org-left">To compose is to put something together, like a song, poem, or even yourself. You might want to compose yourself before returning to the party after a good cry.</td>
<td class="org-left">构成；作曲；使平静</td>
</tr>

<tr>
<td class="org-left">dsiburse</td>
<td class="org-left">If someone wants to disburse funds to you, stick around &#x2014; it means they're going to give you money!</td>
<td class="org-left">支付</td>
</tr>

<tr>
<td class="org-left">conjure</td>
<td class="org-left">If your mom can magically conjure up the most delicious meals from the most random ingredients in the kitchen, she might just be the best cook in the neighborhood.</td>
<td class="org-left">变魔术</td>
</tr>

<tr>
<td class="org-left">symbolic</td>
<td class="org-left">When one thing represents something else that's more abstract, it is symbolic, like a cowboy's black hat in western films is symbolic of his sinister intentions.</td>
<td class="org-left">象征的</td>
</tr>

<tr>
<td class="org-left">arcane</td>
<td class="org-left">Something arcane is understood or known by only a few people. Almost everyone knows the basics of baseball, but only an elite few possess the arcane knowledge of its history that marks the true fan.</td>
<td class="org-left">神秘的；晦涩难解的</td>
</tr>

<tr>
<td class="org-left">esoteric</td>
<td class="org-left">Pssst&#x2026; do you know the secret handshake? If you haven't been brought into the inner circle of those with special knowledge, esoteric things will remain a mystery to you.</td>
<td class="org-left">只有内行才懂的</td>
</tr>

<tr>
<td class="org-left">prescribe</td>
<td class="org-left">To prescribe is make orders or give directions for something to be done. These days, the word is mainly used by doctors who prescribe medications to take.</td>
<td class="org-left">规定；开处方</td>
</tr>

<tr>
<td class="org-left">unanticipated</td>
<td class="org-left">Unanticipated means "unexpected." Finding a candy bar in your lunchbox when your mom usually packs nothing but health food would be an unanticipated delight.</td>
<td class="org-left">意料之外的</td>
</tr>

<tr>
<td class="org-left">expertise</td>
<td class="org-left">When you're an expert at something, you show expertise &#x2014; or an exceptional knowledge of the subject. "He had expertise in accounting, having excelled in math, but he had even more expertise in dancing, his hobby since a small child."</td>
<td class="org-left">专业知识</td>
</tr>

<tr>
<td class="org-left">collapse</td>
<td class="org-left">To collapse means to fall over, cave in, or totally crumple. After finding out that the stock market has collapsed and your investments along with it, you'd probably collapse to the ground and sob uncontrollably.</td>
<td class="org-left">（突然）倒塌；（货币）暴跌</td>
</tr>

<tr>
<td class="org-left">quantitative</td>
<td class="org-left">If your boss asks you to do a quantitative analysis of this month's ice cream sales, he's not asking you to talk about how pleasant the customer interactions were. He wants numbers: how many cones did you sell of each flavor?</td>
<td class="org-left">数量的</td>
</tr>

<tr>
<td class="org-left">formalism</td>
<td class="org-left">there is no transcendent meaning to a discipline other than the literal content created by a practitioner</td>
<td class="org-left">形式主义</td>
</tr>

<tr>
<td class="org-left">conceive</td>
<td class="org-left">To conceive is to come up with an idea. If you conceive a plan for your little brother's birthday, you dream up the perfect party, complete with a magician, rented ponies, and a cake shaped like a rocket.</td>
<td class="org-left">怀孕；构思</td>
</tr>

<tr>
<td class="org-left">acronym</td>
<td class="org-left">An acronym is a word or name formed from the initial components of a longer name or phrase, usually using individual initial letters, as in NATO (North Atlantic Treaty Organization) or EU (European Union), but sometimes using syllables, as in Benelux (Belgium, Netherlands and Luxembourg), or a mixture of the two, as in radar (RAdio Detection And Ranging).</td>
<td class="org-left">首字母缩略词</td>
</tr>

<tr>
<td class="org-left">algebraic</td>
<td class="org-left"> </td>
<td class="org-left">代数的</td>
</tr>

<tr>
<td class="org-left">linguistic</td>
<td class="org-left">Use the adjective linguistic to describe anything related to language, like the linguistic difficulties you might have if you visit a place where you do not speak the same language as everyone else.</td>
<td class="org-left">语言的</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org3dca305" class="outline-2">
<h2 id="org3dca305">学习进度</h2>
<div class="outline-text-2" id="text-org3dca305">
<ul class="org-ul">
<li>2021-07-03 08:00~11:30 读完
<a href="https://mitpress.mit.edu/sites/default/files/sicp/full-text/book/book-Z-H-9.html#%_chap_1">1 Building Abstractions with Procedures</a></li>
<li>2021-07-04 13:00~14:00 查阅
<a href="https://mitpress.mit.edu/sites/default/files/sicp/full-text/book/book-Z-H-9.html#%_chap_1">1 Building Abstractions with Procedures</a> 中不知道意思的生词</li>
</ul>
</div>
</div>
</div>
</body>
</html>